### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/50328347-ca81-461f-bfda-6feae1069fbe/terraform-bin show -no-color plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-530862e0.js"] will be destroyed
  # (because key ["assets/About-530862e0.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b394d678431093421825a4bf48fd3b0b" -> null
      - force_destroy          = true -> null
      - id                     = "assets/About-530862e0.js" -> null
      - key                    = "assets/About-530862e0.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/About-530862e0.js" -> null
      - source_hash            = "b394d678431093421825a4bf48fd3b0b" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-5325ddce.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-5325ddce.js"
      + source_hash            = "5cbd032b29b45e1d0a6d16e96292a9fc"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-6be4f300.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-6be4f300.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "300e9db3e953afab67c0ab1a38cbd780" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ArticleLayouts-6be4f300.js" -> null
      - key                    = "assets/ArticleLayouts-6be4f300.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/ArticleLayouts-6be4f300.js" -> null
      - source_hash            = "300e9db3e953afab67c0ab1a38cbd780" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-d70ea114.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-d70ea114.js"
      + source_hash            = "60f7200ac2f35057bafcea6f92ebcae1"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-1de03003.js"] will be destroyed
  # (because key ["assets/Articles-1de03003.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "78edfc9c3c8a6731b2ff01962608054f" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-1de03003.js" -> null
      - key                    = "assets/Articles-1de03003.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Articles-1de03003.js" -> null
      - source_hash            = "78edfc9c3c8a6731b2ff01962608054f" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-af0b0e6e.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-af0b0e6e.js"
      + source_hash            = "504882fd9335a2a3e3d636628661d79a"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-6e8bdccb.js"] will be destroyed
  # (because key ["assets/Landing-6e8bdccb.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "12221bc87657c35d93286d189ad07cb6" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-6e8bdccb.js" -> null
      - key                    = "assets/Landing-6e8bdccb.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-6e8bdccb.js" -> null
      - source_hash            = "12221bc87657c35d93286d189ad07cb6" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad66df16.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-ad66df16.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-ad66df16.js"
      + source_hash            = "499bb3abadae7842e00e76ebcae1e2be"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-5ddb6fa0.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-5ddb6fa0.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-5ddb6fa0.js"
      + source_hash            = "e8004ffe09d3e370a2bf94f0fdae1cf1"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-7f9b3752.js"] will be destroyed
  # (because key ["assets/PDF-7f9b3752.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "9a9c52ef9369c37b39e0a982413e1a20" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-7f9b3752.js" -> null
      - key                    = "assets/PDF-7f9b3752.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-7f9b3752.js" -> null
      - source_hash            = "9a9c52ef9369c37b39e0a982413e1a20" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-92288b02.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-92288b02.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-92288b02.js"
      + source_hash            = "99a701886613b4206d1454de9f1075a2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-93b3c496.js"] will be destroyed
  # (because key ["assets/Start-93b3c496.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b967565cf189a1dacb32e5450c7be278" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Start-93b3c496.js" -> null
      - key                    = "assets/Start-93b3c496.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Start-93b3c496.js" -> null
      - source_hash            = "b967565cf189a1dacb32e5450c7be278" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-0851a4c9.js"] will be destroyed
  # (because key ["assets/StartButtonFloat-0851a4c9.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "4112007b0dfdfa947c9278a534fdc509" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartButtonFloat-0851a4c9.js" -> null
      - key                    = "assets/StartButtonFloat-0851a4c9.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/StartButtonFloat-0851a4c9.js" -> null
      - source_hash            = "4112007b0dfdfa947c9278a534fdc509" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-41022946.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartButtonFloat-41022946.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartButtonFloat-41022946.js"
      + source_hash            = "b3918b00cf6df8bf63acfab5536d284f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-a4545a61.js"] will be destroyed
  # (because key ["assets/Terminal-a4545a61.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f8627db068e8bcf714c2531dc286e916" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Terminal-a4545a61.js" -> null
      - key                    = "assets/Terminal-a4545a61.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Terminal-a4545a61.js" -> null
      - source_hash            = "f8627db068e8bcf714c2531dc286e916" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-b84267ff.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Terminal-b84267ff.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Terminal-b84267ff.js"
      + source_hash            = "767c45f65711e58cf52349c4b7a7809d"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-47fbc312.js"] will be destroyed
  # (because key ["assets/index-47fbc312.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6d5bc1039d46e63888cab8a19cb1f03c" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index-47fbc312.js" -> null
      - key                    = "assets/index-47fbc312.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index-47fbc312.js" -> null
      - source_hash            = "6d5bc1039d46e63888cab8a19cb1f03c" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-b7d43fd6.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index-b7d43fd6.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index-b7d43fd6.js"
      + source_hash            = "e81f9a76dc589c96abc2896bce6fd70c"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-70f69c98.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-70f69c98.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-70f69c98.js"
      + source_hash            = "b9e6cea64ca620c2cc6d52465f32d3c4"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-8dc65b8e.js"] will be destroyed
  # (because key ["assets/index.es-8dc65b8e.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "323a59f30de9c85064a22297aa37f288" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index.es-8dc65b8e.js" -> null
      - key                    = "assets/index.es-8dc65b8e.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index.es-8dc65b8e.js" -> null
      - source_hash            = "323a59f30de9c85064a22297aa37f288" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      ~ source_hash            = "28593cb9e8c558773b3a2525d306422b" -> "9094f0cb7e9ab095295e9ae4e938f836"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["public/shortpoet_open_graph.png"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "public/shortpoet_open_graph.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/public/shortpoet_open_graph.png"
      + source_hash            = "4c6e339d36b2fc4d517ab6b2558184d2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["public/website_landing.png"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "public/website_landing.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/public/website_landing.png"
      + source_hash            = "6e7caab9b2c97d66d058bff422e7b3e8"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

Plan: 12 to add, 1 to change, 10 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
      - "b394d678431093421825a4bf48fd3b0b",
      - "300e9db3e953afab67c0ab1a38cbd780",
      - "78edfc9c3c8a6731b2ff01962608054f",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "d254e9f4850a323e5ea30df3ac31964d",
      - "12221bc87657c35d93286d189ad07cb6",
        "623d1343a7416bbbdbce909629e9939d",
      + (known after apply),
        "e24945a32789e1abf50be49be251389e",
      - "9a9c52ef9369c37b39e0a982413e1a20",
      - "b967565cf189a1dacb32e5450c7be278",
      - "4112007b0dfdfa947c9278a534fdc509",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "fff573f20a9b2c51b01a41b063cbf6bd",
        "85561bf1ef41088b8c3f0f50a6a1fa81",
      - "f8627db068e8bcf714c2531dc286e916",
      + (known after apply),
        "e60911495dba8bb96def57539a94e9cf",
        # (12 unchanged elements hidden)
        "955bf9b222a46a0897ad2d52916463de",
      - "6d5bc1039d46e63888cab8a19cb1f03c",
        "056b4c93c0fc46fc6fee5d5c316171b9",
      - "323a59f30de9c85064a22297aa37f288",
      + (known after apply),
      + (known after apply),
        "3af47f89e61fe763b909c1fabc4c4083",
        # (7 unchanged elements hidden)
        "28593cb9e8c558773b3a2525d306422b",
      + (known after apply),
      + (known after apply),
    ]
  ~ s3_bucket_object_ids         = [
      - "assets/About-530862e0.js",
      - "assets/ArticleLayouts-6be4f300.js",
      - "assets/Articles-1de03003.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/Articles-cdca7afd.css",
      - "assets/Landing-6e8bdccb.js",
        "assets/Landing-ad247451.css",
      + (known after apply),
        "assets/PDF-19838165.css",
      - "assets/PDF-7f9b3752.js",
      - "assets/Start-93b3c496.js",
      - "assets/StartButtonFloat-0851a4c9.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/StartButtonFloat-7308c767.css",
        "assets/Terminal-2e2ec67e.css",
      - "assets/Terminal-a4545a61.js",
      + (known after apply),
        "assets/azure_devicon_forest_green-ee780a3a.svg",
        # (12 unchanged elements hidden)
        "assets/html2canvas.esm-0a33ed42.js",
      - "assets/index-47fbc312.js",
        "assets/index-9a0f5c31.css",
      - "assets/index.es-8dc65b8e.js",
      + (known after apply),
      + (known after apply),
        "assets/powershell_devicon_forest_green-f06a1fda.svg",
        # (7 unchanged elements hidden)
        "index.html",
      + (known after apply),
      + (known after apply),
    ]
  ~ s3_bucket_object_keys_ids    = [
      ~ {
          ~ id  = "assets/About-530862e0.js" -> (known after apply)
          ~ key = "assets/About-530862e0.js" -> "assets/About-5325ddce.js"
        },
      ~ {
          ~ id  = "assets/ArticleLayouts-6be4f300.js" -> (known after apply)
          ~ key = "assets/ArticleLayouts-6be4f300.js" -> "assets/ArticleLayouts-d70ea114.js"
        },
      ~ {
          ~ id  = "assets/Articles-1de03003.js" -> (known after apply)
          ~ key = "assets/Articles-1de03003.js" -> "assets/Articles-af0b0e6e.js"
        },
        {
            id  = "assets/Articles-cdca7afd.css"
            key = "assets/Articles-cdca7afd.css"
        },
      - {
          - id  = "assets/Landing-6e8bdccb.js"
          - key = "assets/Landing-6e8bdccb.js"
        },
        {
            id  = "assets/Landing-ad247451.css"
            key = "assets/Landing-ad247451.css"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Landing-ad66df16.js"
        },
        {
            id  = "assets/PDF-19838165.css"
            key = "assets/PDF-19838165.css"
        },
      ~ {
          ~ id  = "assets/PDF-7f9b3752.js" -> (known after apply)
          ~ key = "assets/PDF-7f9b3752.js" -> "assets/PDF-5ddb6fa0.js"
        },
      ~ {
          ~ id  = "assets/Start-93b3c496.js" -> (known after apply)
          ~ key = "assets/Start-93b3c496.js" -> "assets/Start-92288b02.js"
        },
      ~ {
          ~ id  = "assets/StartButtonFloat-0851a4c9.js" -> (known after apply)
          ~ key = "assets/StartButtonFloat-0851a4c9.js" -> "assets/StartButtonFloat-41022946.js"
        },
        {
            id  = "assets/StartButtonFloat-7308c767.css"
            key = "assets/StartButtonFloat-7308c767.css"
        },
        {
            id  = "assets/Terminal-2e2ec67e.css"
            key = "assets/Terminal-2e2ec67e.css"
        },
      ~ {
          ~ id  = "assets/Terminal-a4545a61.js" -> (known after apply)
          ~ key = "assets/Terminal-a4545a61.js" -> "assets/Terminal-b84267ff.js"
        },
        {
            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"
            key = "assets/azure_devicon_forest_green-ee780a3a.svg"
        },
        # (12 unchanged elements hidden)
        {
            id  = "assets/html2canvas.esm-0a33ed42.js"
            key = "assets/html2canvas.esm-0a33ed42.js"
        },
      - {
          - id  = "assets/index-47fbc312.js"
          - key = "assets/index-47fbc312.js"
        },
        {
            id  = "assets/index-9a0f5c31.css"
            key = "assets/index-9a0f5c31.css"
        },
      ~ {
          ~ id  = "assets/index.es-8dc65b8e.js" -> (known after apply)
          ~ key = "assets/index.es-8dc65b8e.js" -> "assets/index-b7d43fd6.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/index.es-70f69c98.js"
        },
        {
            id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"
            key = "assets/powershell_devicon_forest_green-f06a1fda.svg"
        },
        # (7 unchanged elements hidden)
        {
            id  = "index.html"
            key = "index.html"
        },
      + {
          + id  = (known after apply)
          + key = "public/shortpoet_open_graph.png"
        },
      + {
          + id  = (known after apply)
          + key = "public/website_landing.png"
        },
    ]
  ~ s3_bucket_object_version_ids = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
        "",
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
        "",
      + (known after apply),
        "",
        # (13 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (6 unchanged elements hidden)
        "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-530862e0.js"] will be destroyed%0A  # (because key ["assets/About-530862e0.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "b394d678431093421825a4bf48fd3b0b" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/About-530862e0.js" -> null%0A      - key                    = "assets/About-530862e0.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/About-530862e0.js" -> null%0A      - source_hash            = "b394d678431093421825a4bf48fd3b0b" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/About-5325ddce.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/About-5325ddce.js"%0A      + source_hash            = "5cbd032b29b45e1d0a6d16e96292a9fc"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-6be4f300.js"] will be destroyed%0A  # (because key ["assets/ArticleLayouts-6be4f300.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "300e9db3e953afab67c0ab1a38cbd780" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/ArticleLayouts-6be4f300.js" -> null%0A      - key                    = "assets/ArticleLayouts-6be4f300.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/ArticleLayouts-6be4f300.js" -> null%0A      - source_hash            = "300e9db3e953afab67c0ab1a38cbd780" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/ArticleLayouts-d70ea114.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/ArticleLayouts-d70ea114.js"%0A      + source_hash            = "60f7200ac2f35057bafcea6f92ebcae1"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-1de03003.js"] will be destroyed%0A  # (because key ["assets/Articles-1de03003.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "78edfc9c3c8a6731b2ff01962608054f" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Articles-1de03003.js" -> null%0A      - key                    = "assets/Articles-1de03003.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/Articles-1de03003.js" -> null%0A      - source_hash            = "78edfc9c3c8a6731b2ff01962608054f" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Articles-af0b0e6e.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Articles-af0b0e6e.js"%0A      + source_hash            = "504882fd9335a2a3e3d636628661d79a"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-6e8bdccb.js"] will be destroyed%0A  # (because key ["assets/Landing-6e8bdccb.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "12221bc87657c35d93286d189ad07cb6" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Landing-6e8bdccb.js" -> null%0A      - key                    = "assets/Landing-6e8bdccb.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/Landing-6e8bdccb.js" -> null%0A      - source_hash            = "12221bc87657c35d93286d189ad07cb6" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad66df16.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Landing-ad66df16.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Landing-ad66df16.js"%0A      + source_hash            = "499bb3abadae7842e00e76ebcae1e2be"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-5ddb6fa0.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/PDF-5ddb6fa0.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/PDF-5ddb6fa0.js"%0A      + source_hash            = "e8004ffe09d3e370a2bf94f0fdae1cf1"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-7f9b3752.js"] will be destroyed%0A  # (because key ["assets/PDF-7f9b3752.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "9a9c52ef9369c37b39e0a982413e1a20" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/PDF-7f9b3752.js" -> null%0A      - key                    = "assets/PDF-7f9b3752.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/PDF-7f9b3752.js" -> null%0A      - source_hash            = "9a9c52ef9369c37b39e0a982413e1a20" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-92288b02.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Start-92288b02.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Start-92288b02.js"%0A      + source_hash            = "99a701886613b4206d1454de9f1075a2"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-93b3c496.js"] will be destroyed%0A  # (because key ["assets/Start-93b3c496.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "b967565cf189a1dacb32e5450c7be278" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Start-93b3c496.js" -> null%0A      - key                    = "assets/Start-93b3c496.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/Start-93b3c496.js" -> null%0A      - source_hash            = "b967565cf189a1dacb32e5450c7be278" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-0851a4c9.js"] will be destroyed%0A  # (because key ["assets/StartButtonFloat-0851a4c9.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "4112007b0dfdfa947c9278a534fdc509" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/StartButtonFloat-0851a4c9.js" -> null%0A      - key                    = "assets/StartButtonFloat-0851a4c9.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/StartButtonFloat-0851a4c9.js" -> null%0A      - source_hash            = "4112007b0dfdfa947c9278a534fdc509" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-41022946.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/StartButtonFloat-41022946.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/StartButtonFloat-41022946.js"%0A      + source_hash            = "b3918b00cf6df8bf63acfab5536d284f"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*